# CanBeAssociatedWithGlobalParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..CanBeAssociatedWithGlobalParameters Method
Parameter Class See Also
---
Tests whether this parameter can be associated with any global parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public bool CanBeAssociatedWithGlobalParameters()
```

Visual Basic
---
```text
Public Function CanBeAssociatedWithGlobalParameters As Boolean
```

Visual C++
---
```text
public:
bool CanBeAssociatedWithGlobalParameters()
```

# ### Return Value
True if the given parameter can be associated (is parametrizable); False otherwise.
# Remarks
Only properties defined as parametrizable can be associated with global parameters. That excludes any read-only and formula-driven parameters, as well as those that have other explicit or implicit restrictions imposed by Revit.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This parameter does not exist in the document anymore. |

# See Also
Parameter Class
Autodesk.Revit.DB Namespace